//**********************************************************************
//
// Name:  <F75113GpioSetup.uni>
//
// Description: F75113 GPIO Form String Definitions
//
//**********************************************************************
/=#
#include "VFR.uni"
//If customer define the common logical device by themselves, add here.

#string STR_F75113_MISC_CONFIG		     #language eng "F75113 MISC Configuration"
#string STR_F75113_MISC_GPIO0X_CONFIG		     #language eng "GPIO0X Configuration"
#string STR_F75113_MISC_GPIO1X_CONFIG		     #language eng "GPIO1X Configuration"
#string STR_F75113_MISC_GPIO2X_CONFIG		     #language eng "GPIO2X Configuration"
#string STR_F75113_MISC_GPIO3X_CONFIG		     #language eng "GPIO3X Configuration"
#string STR_F75113_MISC_GPIO4X_CONFIG		     #language eng "GPIO4X Configuration"

// F75113 GPIO Control
#string STR_F75113_GPIO			     #language eng "F75113 GPIO Setting"
#string STR_F75113_GPIO0X			 #language eng "F75113 GPIO0X Setting"
#string STR_GP00				     #language eng "GP00"
#string STR_GP01				     #language eng "GP01"
#string STR_GP02				     #language eng "GP02"
#string STR_GP03				     #language eng "GP03"
#string STR_GP04				     #language eng "GP04"
#string STR_GP05				     #language eng "GP05"
#string STR_GP06				     #language eng "GP06"
#string STR_GP07				     #language eng "GP07"
#string STR_GP10				     #language eng "GP10"
#string STR_F75113_GPIO1X			 #language eng "F75113 GPIO1X Setting"
#string STR_GP11				     #language eng "GP11"
#string STR_GP12				     #language eng "GP12"
#string STR_GP13				     #language eng "GP13"
#string STR_GP14				     #language eng "GP14"
#string STR_GP15				     #language eng "GP15"
#string STR_GP16				     #language eng "GP16"
#string STR_GP17				     #language eng "GP17"
#string STR_F75113_GPIO2X			 #language eng "F75113 GPIO2X Setting"
#string STR_GP20				     #language eng "GP20"
#string STR_GP21				     #language eng "GP21"
#string STR_GP22				     #language eng "GP22"
#string STR_GP23				     #language eng "GP23"
#string STR_GP24				     #language eng "GP24"
#string STR_GP25				     #language eng "GP25"
#string STR_GP26				     #language eng "GP26"
#string STR_GP27				     #language eng "GP27"
#string STR_F75113_GPIO3X			 #language eng "F75113 GPIO3X Setting"
#string STR_GP30				     #language eng "GP30"
#string STR_GP31				     #language eng "GP31"
#string STR_GP32				     #language eng "GP32"
#string STR_GP33				     #language eng "GP33"
#string STR_GP34				     #language eng "GP34"
#string STR_GP35				     #language eng "GP35"
#string STR_GP36				     #language eng "GP36"
#string STR_GP37				     #language eng "GP37"
#string STR_F75113_GPIO4X			 #language eng "F75113 GPIO4X Setting"
#string STR_GP40				     #language eng "GP40"
#string STR_GP41				     #language eng "GP41"
#string STR_GP42				     #language eng "GP42"
#string STR_GP43				     #language eng "GP43"
#string STR_GP44				     #language eng "GP44"
#string STR_GP45				     #language eng "GP45"

#string STR_GPIO_TYPE				     #language eng "  GPIO Type"
#string STR_GPIO_TYPE_HELP			     #language eng "GPIO Direction Type Setting"
#string STR_GPIO_OUTPUT				     #language eng "Output"
#string STR_GPIO_INPUT				     #language eng "Input"
#string STR_GPIO_DATA				     #language eng "    GPIO Data"
#string STR_GPIO_DATA_HELP			     #language eng "GPIO Output High/Low Setting"
#string STR_GPIO_LOW				     #language eng "Low"
#string STR_GPIO_HIGH				     #language eng "High"
#string STR_GPIO_INV				     #language eng "  GPIO Inversion"
#string STR_GPIO_INV_HELP			     #language eng "GPIO Inversion Setting"
#string STR_NORMAL				     #language eng "Normal"
#string STR_INVERTED				     #language eng "Inverted"

//#string <string name>                   #language eng ""
